:PROPERTIES:
:ID:       48b0f334-cc58-416a-a363-f6b5411ab7e7
:END:
#+title: Static
#+filetags: :C:

- tags :: [[id:65da1215-662a-497a-83fa-b38a3c8e9e0c][C]]

* Static Variables
Static variables can preserve its value in the scoupe it belongs to. That means, when you call a function more than one time, the static variables will not be redeclared and reinitialize.

#+begin_src C
  #include <stdio.h>

  int fun()
  {
      static int x = 10;
      x++;
      return x;
  }

  int main()
  {
      printf("%d\n", fun());
      printf("%d\n", fun());
      printf("%d\n", fun());
      return 0;
  }
#+end_src

#+RESULTS:
| 11 |
| 12 |
| 13 |

* Static Functions
Static functions can only be called inside the file that it is declared.

#+begin_src C
#include <stdio.h>

void staticFunc(void){
   printf("Inside the static function staticFunc() ");
}

int main()
{
   staticFunc();
   return 0;
}
#+end_src

#+RESULTS:
: Inside the static function staticFunc()

